#### Pandas -Data Frame and Series 

Pandas is a powerful data manipulation library inpython,widely used for data analysis and data cleaning .It provides two primary data stuctures : series and DataFrame. A series is a one -dimension array-like objects ,while a data frame is a two -dimension ,size-muatable and potentially heterogenous tabular data structure with labeled axes( rows and column)

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\91945\appdata\roaming\python\python312\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91945\appdata\roaming\python\python312\site-packages (from pandas) (2.0.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91945\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\91945\appdata\roaming\python\python312\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\91945\appdata\roaming\python\python312\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\91945\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [4]:
## series 
#  a one dimension array like objects that can hold any data type .it is similar to a column in a table

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
## Create a series from the dictonary element
data ={'a':1,'b':2,'c':3}
series_dicpd=pd.Series(data)
print(series_dicpd)

a    1
b    2
c    3
dtype: int64

In [6]:
## 
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
## Data frame
### Create a data frame from a dict of a list
data={
    'name':['Gopal','Gaurav','Jatin'],
    'age':[22,21,23],
    'city':['Gkp','Luckknow','Kanpur']
    
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     name  age      city
0   Gopal   22       Gkp
1  Gaurav   21  Luckknow
2   Jatin   23    Kanpur
<class 'pandas.core.frame.DataFrame'>

In [8]:
import numpy as np
np.array(df)

array([['Gopal', 22, 'Gkp'],
       ['Gaurav', 21, 'Luckknow'],
       ['Jatin', 23, 'Kanpur']], dtype=object)

In [9]:
## Create a data frame from a list of dict
data=[
    {'name':'Gopal','age':22,'city':'Gkp'},
    {'name':'Guarv','age':21,'city':'luc'},
    {'name':'jatin','age':20,'city':'kanput'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age    city
0  Gopal   22     Gkp
1  Guarv   21     luc
2  jatin   20  kanput
<class 'pandas.core.frame.DataFrame'>

In [10]:
data={
    'name':['Gopal','Gaurav','Jatin'],
    'age':[22,21,23],
    'city':['Gkp','Luckknow','Kanpur']
    
}

In [11]:
df=pd.DataFrame(df)

In [12]:
print(df)

    name  age    city
0  Gopal   22     Gkp
1  Guarv   21     luc
2  jatin   20  kanput

In [13]:
type(df['name'])

pandas.core.series.Series

In [14]:
df.loc[0]

name    Gopal
age        22
city      Gkp
Name: 0, dtype: object

In [15]:
df.iloc[0]

name    Gopal
age        22
city      Gkp
Name: 0, dtype: object

In [16]:
df.iloc[1][0]

C:\Users\91945\AppData\Local\Temp\ipykernel_35536\1019881219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0]

'Guarv'

In [17]:
## Accesing a specified element 
df.at[2,'age']

np.int64(20)

In [18]:
df.at[2,'name']

'jatin'

In [19]:
## Accesing the specified element using iat
df.iat[2,2]

'kanput'

In [20]:
df

    name  age    city
0  Gopal   22     Gkp
1  Guarv   21     luc
2  jatin   20  kanput

In [21]:
### Data manuplation with data frames 
df

    name  age    city
0  Gopal   22     Gkp
1  Guarv   21     luc
2  jatin   20  kanput

In [22]:
## Additng a coloum 
df['Salary']=[5000,6000,7000]
df

    name  age    city  Salary
0  Gopal   22     Gkp    5000
1  Guarv   21     luc    6000
2  jatin   20  kanput    7000

In [23]:
## Remove a colum 
df.drop('Salary',axis=1)  ## Temorary operatin

    name  age    city
0  Gopal   22     Gkp
1  Guarv   21     luc
2  jatin   20  kanput

In [24]:
df

    name  age    city  Salary
0  Gopal   22     Gkp    5000
1  Guarv   21     luc    6000
2  jatin   20  kanput    7000

In [25]:
## Remove a colum 
df.drop('Salary',axis=1,inplace=True)

In [26]:
df

    name  age    city
0  Gopal   22     Gkp
1  Guarv   21     luc
2  jatin   20  kanput

In [27]:
## Add age to column
df['age']=df['age']+1

In [28]:
df

    name  age    city
0  Gopal   23     Gkp
1  Guarv   22     luc
2  jatin   21  kanput

In [29]:
df.drop(0)

    name  age    city
1  Guarv   22     luc
2  jatin   21  kanput

In [30]:
df

    name  age    city
0  Gopal   23     Gkp
1  Guarv   22     luc
2  jatin   21  kanput

In [31]:
df.drop(0,inplace=True)

In [32]:
df

    name  age    city
1  Guarv   22     luc
2  jatin   21  kanput

In [33]:
print(" Mahesh chutiya h aur thoda sa gandu bhi h ")

 Mahesh chutiya h aur thoda sa gandu bhi h

In [34]:
print("Hi ! how are you")

Hi ! how are you

In [36]:
df=pd.read_csv('practice_data.csv')
df.head(5)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...

In [37]:
df.tail(5)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
50980,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50981,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50982,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50983,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50984,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."